Revit 2024 API
DirectShapeType.IsValidReferencePlaneBoundingBoxUV Method
 Validates that the input BoundingBoxUV is suitable for bounding a reference plane surface. The input BoundingBoxUV must be set and not degenerate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static bool IsValidReferencePlaneBoundingBoxUV(
	BoundingBoxUV boundingBoxUV
)
Visual Basic
Public Shared Function IsValidReferencePlaneBoundingBoxUV ( _
	boundingBoxUV As BoundingBoxUV _
) As Boolean
Visual C++
public:
static bool IsValidReferencePlaneBoundingBoxUV(
	BoundingBoxUV^ boundingBoxUV
)
Parameters
boundingBoxUV
Type: Autodesk.Revit.DB.BoundingBoxUV
 The reference plane BoundingBoxUV to test.
Return Value
 True if the input BoundingBoxUV is valid for reference plane surfaces, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace